[
  {
    "title": "About Me",
    "image": "PictureMe.jpg",
    "description": "As a kid i spent most of my childhood playing jrpg and rpgs and getting absorbed in larg worlds. Talking about video game worlds and my favorite characters with my friends where fun, and we discussed what a world would look like if we were the onces making games. That curiosity made me start reserching on howto make a game, programming were one of the requirements, that set my carrer \n\n I currently have a bachelors degree in computer information systems. Through my 4 year ive picked up good programming skills and practiceses. In this 4 years i began to experiment doing game jams to test and build my programming skills  and learn how to work in a group, wich i love, getting the chance to share ideas with other a building something together \n\n On my free time i like working and testing on ideas,that i may one day use for a game, or learn a new engine or a pattern to help with future development. I like sharpening my skilss",
    "tasks":[],
    "links": []

  },
  {
    "title": "Game Design and Development",
    "description": "Hi, my name is Laurence. I have experience in game design and scripting, and what I love most about game development is combining my creativity with my programming skills to create interactive experiences that are fun and memorable for players.",
    "tasks":[],
    "links": [{
      "title": "LinkedIn",
      "url": "https://sadslothh.itch.io/"
    },{
      "title": "Gmail",
      "url": "mailto:laurencemunoko@gmail.com"
    }],
    "linkName": "Contact Me"


  },
  {
    "title": "Bright Burn",
    "video": "SvnV1eUTaz4?si=xz6UQmpQxad80MTi",
    "description": "Bright Bern was my senior-year project at Mount Royal University, an independently developed fighting game mixed with soccer. I wanted to create something easy to learn but hard to master, since I’ve always found traditional fighting games too time-consuming to pick up. My responsibilities included",
    "tasks": [
      {
        "task": "Game design"
        
        
      },
      {
        "task": "Character design"
      },
      {
        "task":"Art"
      },{
        "task":"Programming (gameplay and characters)"
      }
    ],
    "linkName": "Play",
    
    "links": [
      {
        "title": "Itch.io",
        "url": "https://sadslothh.itch.io/bright-burn"
      }
    ]
  },
  {
    "image": "EgoArena.png",
    "title": "Ego Arena",
    "description": "I collaborated with five other developers to create Ego Arena, a two-player fighting game where you type insults to attack each other. Since we had enough programmers, I adapted to an art role and contributed by creating:",
    "tasks":[
      {
      "task": "Background art"
    },{
      "task":"Stage design"
    }
  ],
    "links": [
      {
        "title": "Global Game Jam",
        "url": "https://globalgamejam.org/games/2025/ego-arena-5"
        }
    ],
    "linkName": "Play At"
  },
  {
    "title": "itch.io",
    "description": "You can find the rest of my projects on itch.io",
    "tasks":[
     
  ],
    "links": [
      {
        "title": "Itch.io",
        "url": "https://sadslothh.itch.io"
        }
    ]
  }


]

